Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/SUI_ВладельцыНастроекДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ВладельцыНастроекДокументов</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЭтоНовый;

Перем МетаданныеДокумента;

Перем СхемаКомпоновкиДанных;

Перем ОписаниеРеквизитовДокумента;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеТиповТаблиц(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеРеквизитовДокумента = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяМетаданныхДокумента);
	
	Для Каждого СтрокаНастройкиТаблиц Из НастройкиТаблиц Цикл
		
		Если ПустаяСтрока(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРеквизитовТЧ = ОписаниеРеквизитовДокумента.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти, "Имя", Ложь);
			
		Если ОписаниеРеквизитовТЧ = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Табличная часть %1 не существует для документа %2'"),
				СтрокаНастройкиТаблиц.ИмяТабличнойЧасти, СинонимМетаданныхДокумента);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.НастройкиТаблиц", , Отказ);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив();
	
	// Проверить заполнение идентификацию строк
	ПроверитьЗаполнениеИдентификацииСтрок(Отказ);
	
	// Проверить заполнение Постобработка Заполнение реквизитов
	ПроверитьЗаполнениеПостобработкаЗаполнениеРеквизитов(Отказ);
	
	// Проверить заполнение Постобработка Создание документов на основании
	ПроверитьЗаполнениеПостобработкаСозданияДокументовНаОсновании(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеТиповТаблиц(Отказ);
	
	ЭтоНовый = ЭтоНовый();
	
	СвернутьТаблицыНастроек();
	
	ИнициализироватьМетаданныеДокумента();
	ИнициализироватьСхемуКомпоновкиДанных();
	
	СинонимМетаданныхДокумента = МетаданныеДокумента.Синоним;
	
	// Настройки компоновки данных Отбор документов
	Если ДополнительныеСвойства.Свойство("АдресНастроекОтбораДокументов") Тогда
		ИнициализироватьНастройкиКомпоновкиОтбораДокументов(ДополнительныеСвойства.АдресНастроекОтбораДокументов);
	Иначе
		ИнициализироватьНастройкиКомпоновкиОтбораДокументов(ХранилищеНастроекОтбораДокументов);
	КонецЕсли;
	
	// Настройки компоновки данных настроек реквизитов
	Если ДополнительныеСвойства.Свойство("НастройкиКомпоновкиНастроекРеквизитов") Тогда
		ИнициализироватьНастройкиКомпоновкиНастроекРеквизитов(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеСвойства, "НастройкиКомпоновкиНастроекРеквизитов", Новый Соответствие(), Тип("Соответствие")));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПривязатьМобильныеУстройства") И ДополнительныеСвойства.ПривязатьМобильныеУстройства Тогда
		ПривязатьМобильныеУстройстваКТекущейНастройкеПриЗаписи();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьМетаданныеДокумента()
	
	МетаданныеДокумента = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьМетаданныеДокумента(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.Проверить(МетаданныеДокумента <> Неопределено,
		СтрШаблон(НСтр("ru = 'Не удалось определить метаданные документа по имени ""%1""'"), ИмяМетаданныхДокумента),
		НСтр("ru = 'ИнициализироватьМетаданныеДокумента'"));
	
КонецПроцедуры

Процедура СвернутьТаблицыНастроек()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючиСвязи", НастройкиТаблиц.ВыгрузитьКолонку("КлючСвязи"));
	Запрос.Параметры.КлючиСвязи.Добавить(SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("НастройкиИдентификацииСтрок", НастройкиИдентификацииСтрок.Выгрузить());
	Запрос.УстановитьПараметр("ПостобработкаЗаполнениеРеквизитов", ПостобработкаЗаполнениеРеквизитов.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиИдентификацииСтрок.НомерСтроки,
		|	НастройкиИдентификацииСтрок.КлючСвязи,
		|	НастройкиИдентификацииСтрок.Реквизит
		|ПОМЕСТИТЬ втНастройкиИдентификацииСтрок
		|ИЗ
		|	&НастройкиИдентификацииСтрок КАК НастройкиИдентификацииСтрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПостобработкаЗаполнениеРеквизитов.НомерСтроки,
		|	ПостобработкаЗаполнениеРеквизитов.КлючСвязи,
		|	ПостобработкаЗаполнениеРеквизитов.Реквизит,
		|	ПостобработкаЗаполнениеРеквизитов.Значение,
		|	ПостобработкаЗаполнениеРеквизитов.ПриРасхождении
		|ПОМЕСТИТЬ втПостобработкаЗаполнениеРеквизитов
		|ИЗ
		|	&ПостобработкаЗаполнениеРеквизитов КАК ПостобработкаЗаполнениеРеквизитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНастройкиИдентификацииСтрок.КлючСвязи,
		|	втНастройкиИдентификацииСтрок.Реквизит
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(втНастройкиИдентификацииСтрок.НомерСтроки) КАК НомерСтроки,
		|		втНастройкиИдентификацииСтрок.КлючСвязи,
		|		втНастройкиИдентификацииСтрок.Реквизит
		|	ИЗ
		|		втНастройкиИдентификацииСтрок КАК втНастройкиИдентификацииСтрок
		|	ГДЕ
		|		втНастройкиИдентификацииСтрок.КлючСвязи В (&КлючиСвязи)
		|	СГРУППИРОВАТЬ ПО
		|		втНастройкиИдентификацииСтрок.КлючСвязи,
		|		втНастройкиИдентификацииСтрок.Реквизит) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНастройкиИдентификацииСтрок КАК втНастройкиИдентификацииСтрок
		|		ПО ВложенныйЗапрос.КлючСвязи = втНастройкиИдентификацииСтрок.КлючСвязи
		|		И ВложенныйЗапрос.Реквизит = втНастройкиИдентификацииСтрок.Реквизит
		|		И ВложенныйЗапрос.НомерСтроки = втНастройкиИдентификацииСтрок.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПостобработкаЗаполнениеРеквизитов.КлючСвязи,
		|	втПостобработкаЗаполнениеРеквизитов.Реквизит,
		|	втПостобработкаЗаполнениеРеквизитов.Значение,
		|	втПостобработкаЗаполнениеРеквизитов.ПриРасхождении
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(втПостобработкаЗаполнениеРеквизитов.НомерСтроки) КАК НомерСтроки,
		|		втПостобработкаЗаполнениеРеквизитов.КлючСвязи,
		|		втПостобработкаЗаполнениеРеквизитов.Реквизит
		|	ИЗ
		|		втПостобработкаЗаполнениеРеквизитов КАК втПостобработкаЗаполнениеРеквизитов
		|	ГДЕ
		|		втПостобработкаЗаполнениеРеквизитов.КлючСвязи В (&КлючиСвязи)
		|	СГРУППИРОВАТЬ ПО
		|		втПостобработкаЗаполнениеРеквизитов.КлючСвязи,
		|		втПостобработкаЗаполнениеРеквизитов.Реквизит) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПостобработкаЗаполнениеРеквизитов КАК втПостобработкаЗаполнениеРеквизитов
		|		ПО ВложенныйЗапрос.КлючСвязи = втПостобработкаЗаполнениеРеквизитов.КлючСвязи
		|		И ВложенныйЗапрос.Реквизит = втПостобработкаЗаполнениеРеквизитов.Реквизит
		|		И ВложенныйЗапрос.НомерСтроки = втПостобработкаЗаполнениеРеквизитов.НомерСтроки";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НастройкиИдентификацииСтрок.Загрузить(РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выгрузить());
	ПостобработкаЗаполнениеРеквизитов.Загрузить(РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить());
	
КонецПроцедуры

Процедура ПривязатьМобильныеУстройстваКТекущейНастройкеПриЗаписи()
	
	НаборЗаписей = РегистрыСведений.SUI_ВладельцыНастроекДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаДокумента.Установить(Ссылка);
	НаборЗаписей.Заполнить(Новый Структура());
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ПроверкаЗаполнения

Процедура ПроверитьЗаполнениеИдентификацииСтрок(Отказ)
	
	МассивСообщенийНаОтказ = Новый Массив();
	
	Для Каждого СтрокаНастройкиТаблиц Из НастройкиТаблиц Цикл
		
		Если ПустаяСтрока(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтрокиИдентификацииСтрок = НастройкиИдентификацииСтрок.НайтиСтроки(
			Новый Структура("КлючСвязи", СтрокаНастройкиТаблиц.КлючСвязи));
			
		Если НайденныеСтрокиИдентификацииСтрок.Количество() = 0 Тогда
			МассивСообщенийНаОтказ.Добавить(
				СтрШаблон(НСтр("ru = '[Идентификация строк %1] Не заполнены настройки'"), СтрокаНастройкиТаблиц.ТипТаблицы));
		Иначе
			
			ОписаниеРеквизитовТЧ = ОписаниеРеквизитовДокумента.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
				.Строки.Найти(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти, "Имя", Ложь);
			
			Для индекс = 0 По НайденныеСтрокиИдентификацииСтрок.ВГраница() Цикл
				
				Если ПустаяСтрока(НайденныеСтрокиИдентификацииСтрок[индекс].Реквизит) Тогда
					Продолжить;
				ИначеЕсли ОписаниеРеквизитовТЧ.Строки.Найти(НайденныеСтрокиИдентификацииСтрок[индекс].Реквизит, "Имя", Ложь) = Неопределено Тогда
					МассивСообщенийНаОтказ.Добавить(
						СтрШаблон(НСтр("ru = '[Идентификация строк %1] Реквизит %2 не принадлежит табличной части'"), 
						СтрокаНастройкиТаблиц.ТипТаблицы, НайденныеСтрокиИдентификацииСтрок[индекс].Реквизит));
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для индекс = 0 По МассивСообщенийНаОтказ.ВГраница() Цикл
		ОбщегоНазначения.СообщитьПользователю(МассивСообщенийНаОтказ[индекс], ЭтотОбъект, "НастройкиТаблиц", , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПостобработкаЗаполнениеРеквизитов(Отказ)
	
	МассивСообщенийНаОтказ = Новый Массив();
	
	ОписаниеРеквизитов = ОписаниеРеквизитовДокумента.Строки.Найти("Реквизиты", "Имя", Ложь);
	
	СтрокиПостобработкаЗаполнениеРеквизитов = ПостобработкаЗаполнениеРеквизитов.НайтиСтроки(
		Новый Структура("КлючСвязи", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор()));
	
	Для индекс = 0 По СтрокиПостобработкаЗаполнениеРеквизитов.ВГраница() Цикл
		
		Если ПустаяСтрока(СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит) Тогда
			Продолжить;
		ИначеЕсли ОписаниеРеквизитов.Строки.Найти(СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит, "Имя", Ложь) = Неопределено Тогда
			МассивСообщенийНаОтказ.Добавить(
				СтрШаблон(НСтр("ru = '[Заполнение реквизитов документа] Реквизит %1 не принадлежит документу'"), 
				СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит));
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеРеквизитов = ОписаниеРеквизитовДокумента.Строки.Найти("ТабличныеЧасти", "Имя", Ложь);
	
	Для Каждого СтрокаНастройкиТаблиц Из НастройкиТаблиц Цикл
		
		Если ПустаяСтрока(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРеквизитовТЧ = ОписаниеРеквизитов.Строки.Найти(СтрокаНастройкиТаблиц.ИмяТабличнойЧасти, "Имя", Ложь);
		
		СтрокиПостобработкаЗаполнениеРеквизитов = ПостобработкаЗаполнениеРеквизитов.НайтиСтроки(
			Новый Структура("КлючСвязи", СтрокаНастройкиТаблиц.КлючСвязи));
		
		Для индекс = 0 По СтрокиПостобработкаЗаполнениеРеквизитов.ВГраница() Цикл
			
			Если ПустаяСтрока(СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит) Тогда
				Продолжить;
			ИначеЕсли ОписаниеРеквизитовТЧ.Строки.Найти(СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит, "Имя", Ложь) = Неопределено Тогда
				МассивСообщенийНаОтказ.Добавить(
					СтрШаблон(НСтр("ru = '[Заполнение реквизитов таблицы %1] Реквизит %2 не принадлежит табличной части документа'"), 
					СтрокаНастройкиТаблиц.ТипТаблицы, СтрокиПостобработкаЗаполнениеРеквизитов[индекс].Реквизит));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для индекс = 0 По МассивСообщенийНаОтказ.ВГраница() Цикл
		ОбщегоНазначения.СообщитьПользователю(МассивСообщенийНаОтказ[индекс], ЭтотОбъект, "НастройкиТаблиц", , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПостобработкаСозданияДокументовНаОсновании(Отказ)
	
	Если ПостобработкаСозданиеДокументовНаОсновании.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСообщенийНаОтказ = Новый Массив();
	
	ИменаДокументовОснования = SUI_НастройкиДокументовПовтИсп.СписокДокументовВводимыхНаОсновании(ИмяМетаданныхДокумента);
	
	Для Каждого СтрокаПостобработкаСозданиеДокументовНаОсновании Из ПостобработкаСозданиеДокументовНаОсновании Цикл
		
		Если ПустаяСтрока(СтрокаПостобработкаСозданиеДокументовНаОсновании.ИмяДокумента) Тогда
			Продолжить;
		ИначеЕсли ИменаДокументовОснования.НайтиПоЗначению(СтрокаПостобработкаСозданиеДокументовНаОсновании.ИмяДокумента) = Неопределено Тогда
			МассивСообщенийНаОтказ.Добавить(
				СтрШаблон(НСтр("ru = '[Создание на основании] Документ %1 не вводится на основании %2'"), 
				СтрокаПостобработкаСозданиеДокументовНаОсновании.ИмяДокумента, СинонимМетаданныхДокумента));
		КонецЕсли;
		
	КонецЦикла;
	
	Для индекс = 0 По МассивСообщенийНаОтказ.ВГраница() Цикл
		ОбщегоНазначения.СообщитьПользователю(МассивСообщенийНаОтказ[индекс], ЭтотОбъект, "ПостобработкаСозданиеДокументовНаОсновании", , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТиповТаблиц(Отказ)
	
	НастроеннаяТаблица = Неопределено;
	
	Для Каждого СтрокаНастройкаТаблицы Из НастройкиТаблиц Цикл
		
		Если СтрокаНастройкаТаблицы.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
			СтрокаНастройкаТаблицы.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			СтрокаНастройкаТаблицы.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			
			Если НастроеннаяТаблица = Неопределено Тогда
				НастроеннаяТаблица = СтрокаНастройкаТаблицы.ТипТаблицы;
			Иначе
				ШаблонСообщения = НСтр("ru = 'Таблица %1 не может совместно использоваться с таблицей %2'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаНастройкаТаблицы.ТипТаблицы, НастроеннаяТаблица);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияКомпоновкиДанных

Процедура ИнициализироватьСхемуКомпоновкиДанных()
	
	ПараметрыСхемы = Новый Структура();
	ПараметрыСхемы.Вставить("Ссылка");
	
	СхемаКомпоновкиДанных = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьСхемуКомпоновкиДанных(ЭтотОбъект, , ПараметрыСхемы);
	
	ОбщегоНазначенияКлиентСервер.Проверить(СхемаКомпоновкиДанных <> Неопределено,
		СтрШаблон(НСтр("ru = 'Не удалось инициализировать схему компоновки данных документа по имени ""%1""'"), ИмяМетаданныхДокумента),
		НСтр("ru = 'ИнициализироватьМетаданныеДокумента'"));
	
	ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных, Новый СжатиеДанных(9));
	
КонецПроцедуры

Функция ИнициализироватьКомпоновщикИПолучитьНастройки(НастройкиКД, ПоместитьВХранилищеЗначений = Истина, ДобавитьГруппировку = Истина)
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаКомпоновкиДанных, 
		НастройкиКД, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	ИнициализированныеНастройкиКД = Компоновщик.ПолучитьНастройки();
	
	Если ДобавитьГруппировку Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(ИнициализированныеНастройкиКД);
	КонецЕсли;
	
	Если ПоместитьВХранилищеЗначений Тогда
		Возврат Новый ХранилищеЗначения(ИнициализированныеНастройкиКД, Новый СжатиеДанных(9));
	Иначе
		Возврат ИнициализированныеНастройкиКД;
	КонецЕсли;
	
КонецФункции

Процедура ИнициализироватьНастройкиКомпоновкиОтбораДокументов(НастройкиКД)
	
	ХранилищеНастроекОтбораДокументов = ИнициализироватьКомпоновщикИПолучитьНастройки(НастройкиКД);
	
КонецПроцедуры

Процедура ИнициализироватьНастройкиКомпоновкиНастроекРеквизитов(КоллекцияНастроекКомпоновкиНастройкиРеквизитов)
	
	ОписаниеТипаНастройкиКД = Новый ОписаниеТипов("НастройкиКомпоновкиДанных");
	НастройкиКДОтбор = ОписаниеТипаНастройкиКД.ПривестиЗначение(ХранилищеНастроекОтбораДокументов.Получить());
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных();
	
	SUI_КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКД.Отбор, НастройкиКДОтбор.Отбор);
	
	СкопироватьНастройкиКомпоновкиНастроекРеквизитов(НастройкиКД, 
		КоллекцияНастроекКомпоновкиНастройкиРеквизитов.Получить(SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор()));
	
	ХранилищеНастроекРеквизитовДокумента = ИнициализироватьКомпоновщикИПолучитьНастройки(НастройкиКД);
	
	Для Каждого СтрокаНастройкиТаблиц Из НастройкиТаблиц Цикл
		
		НастройкиКД = Новый НастройкиКомпоновкиДанных();
		
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКД.Отбор, НастройкиКДОтбор.Отбор);
		
		СкопироватьНастройкиКомпоновкиНастроекРеквизитов(НастройкиКД, 
			КоллекцияНастроекКомпоновкиНастройкиРеквизитов.Получить(СтрокаНастройкиТаблиц.КлючСвязи));
		
		СтрокаНастройкиТаблиц.ХранилищеНастроекРеквизитовТаблицы = ИнициализироватьКомпоновщикИПолучитьНастройки(НастройкиКД);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьНастройкиКомпоновкиНастроекРеквизитов(Приемник, Источник)
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Приемник.ПользовательскиеПоля, Источник.ПользовательскиеПоля);
	
	Для Каждого Элемент Из Источник.Выбор.Элементы Цикл
		
		ПолеСтрокой = Строка(Элемент.Поле);
		
		Если СтрНачинаетсяС(ПолеСтрокой, "ПользовательскиеПоля.Поле") Тогда
			ПутьКДанным = ПолеСтрокой;
		Иначе
			
			ПользовательскоеПоле = Приемник.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
			ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
			ВариантПользовательскогоПоля.Значение = Новый ПолеКомпоновкиДанных(ПолеСтрокой);
			ПутьКДанным = ПользовательскоеПоле.ПутьКДанным;
			
		КонецЕсли;
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Приемник, ПутьКДанным, Элемент.Заголовок);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакСсылочногоТипаВНастройкахРеквизитов(КоллекцияСтрокНастройкиРеквизитов, НастройкиКомпоновки, ПутьКДаннымРодитель = "")
	
	Для индекс = 0 По КоллекцияСтрокНастройкиРеквизитов.ВГраница() Цикл
		
		СсылочныйТип = Ложь;
		
		Если Не КоллекцияСтрокНастройкиРеквизитов[индекс].ИспользуетсяПостоянноеЗначение Тогда
			
			Если ПустаяСтрока(ПутьКДаннымРодитель) Тогда
				ПутьКДанным = КоллекцияСтрокНастройкиРеквизитов[индекс].ИмяРеквизита;
			ИначеЕсли Не ПустаяСтрока(КоллекцияСтрокНастройкиРеквизитов[индекс].ИмяРеквизита) Тогда
				ПутьКДанным = ПутьКДаннымРодитель + "." + КоллекцияСтрокНастройкиРеквизитов[индекс].ИмяРеквизита;
			Иначе
				ПутьКДанным = "";
			КонецЕсли;
			
			ПолеКД = Новый ПолеКомпоновкиДанных(ПутьКДанным);
			
			Если ЗначениеЗаполнено(ПолеКД) Тогда
				
				ДоступноеПоле = НастройкиКомпоновки.ДоступныеПоляВыбора.НайтиПоле(ПолеКД);
				Если ДоступноеПоле <> Неопределено Тогда
					СсылочныйТип = SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ДоступноеПоле.ТипЗначения);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		КоллекцияСтрокНастройкиРеквизитов[индекс].СсылочныйТип = СсылочныйТип;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
